Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: ལྷ་ལྷ་ཆེན་པོ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས། ཡང་དང་ཡང་བལྟས་ཏེ། ལྷ་ལྷ་ཆེན་པོའི་དྲུང་ནས་སོང་ངོ་།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the deva Mahādeva, circumambulated the deva Mahādeva many hundreds of thousands of times, keeping him to his right, and, looking back again and again, departed from the deva Mahādeva.

source: །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་མཐར་གྱིས་ཡུལ་མ་གདྷའི་སྙིང་པོ་བྱང་ཆུབ་ཏུ་སའི་ལྷ་མོ་བརྟན་མ་གང་ན་བ་དེར་སོང་བ་དང་དེ་འགྲོ་བའི་ཚེ་སའི་ལྷ་མོ་བརྒྱ་སྟོང་ཕྲག་བཅུ་གཅིག་ལ་གཅིག་འདི་སྐད་ཅེས་འཛེར་ཏོ།
en: Sthāvarā Then Sudhana, the head merchant’s son, eventually reached the goddess of the earth, Sthāvarā, in the land of Magadha’s bodhimaṇḍa.

source: །སེམས་ཅན་ཐམས་ཅད་ཀྱི་རྟེན་དུ་འགྱུར་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་།
en: When he arrived there, one million earth goddesses proclaimed to one another, “Someone who will be a refuge for all beings is coming here!

source: །དེ་བཞིན་གཤེགས་པའི་སྙིང་པོ་ཅན་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་སྒོ་ངའི་སྦུབས་འདྲ་ལ་བར་འགྱུར་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་།
en: Someone who has the essence of the tathāgatas and who will break open the enclosing egg of ignorance of all beings is coming here!

source: །ཆོས་ཀྱི་རྒྱལ་པོའི་རིགས་སུ་བྱུང་བ་ཆགས་པ་མེད་ཅིང་དྲི་མ་མེད་པའི་ཆོས་ཀྱི་རྒྱལ་པོའི་གོ་འཕང་དམ་པ་འཐོབ་པར་འགྱུར་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་།
en: Someone who is in the family of the kings of Dharma and will attain the state of an unimpeded, stainless king of the Dharma is coming here!

source: །ཡེ་ཤེས་ཀྱི་མཐུ་བོ་ཆེ་རྡོ་རྗེའི་མཚོན་ཆ་ཅན་དཔའ་བོ་ཕས་ཀྱི་རྒོལ་བའི་འཁོར་ཐམས་ཅད་རབ་ཏུ་འདུལ་བ་ཞིག་ནི་འདི་ནས་ཚུར་འོང་ངོ་ཞེས་ནས།
en: Someone who is a hero with the thunderbolt weapon that has the great power of wisdom and who will subdue the circle of opponents is coming here!”

source: དེའི་མོད་ལ་ལྷ་མོ་བརྟན་མ་ལ་སྩོགས་པ། སའི་ལྷ་མོ་བརྒྱ་སྟོང་ཕྲག་བཅུས་ས་ཆེན་པོ་རབ་ཏུ་བསྐྱོད་དེ། འབྲུག་སྒྲ་ཟབ་མོ་ལྟ་བུའི་སྒྲ་ཆེན་པོ་གྲག་པར་བྱས་ནས། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འོད་ཆེན་པོས་སྣང་བར་བྱས་ཏེ།
en: At that moment, Sthāvarā and the other one million earth goddesses shook the great earth, caused a loud sound like deep thunder, and illuminated the world realm of a billion worlds with a vast light.

source: ལུས་རིན་པོ་ཆེའི་རྒྱན་དང་། ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱིས་ཤིན་ཏུ་བརྒྱན་ནས།
en: Their bodies were adorned by all adornments and precious jewelry.

source: གློག་གི་ཕྲེང་བའི་ཚོགས་ནམ་མཁའི་དབྱིངས་ལས་འགྱུ་ཞིང་སྣང་བ་ལྟ་བུ་ཤ་སྟག་དུ་བྱས་ཏེ།
en: They shone and moved in the sky like a mass of streaks of lightning.

source: ཤིང་ཐམས་ཅད་ཀྱི་མྱུ་གུ་ནི་སྐྱེ་བར་བྱེད།
en: They rose up out of the ground, causing the seedlings of all trees to sprout;

source: མེ་ཏོག་གི་ཤིང་ཐམས་ཅད་ནི་ཁ་འབུ་བར་བྱེད།
en: causing all flowering trees to blossom;

source: ཆུ་ཀླུང་གི་རྒྱུན་ཐམས་ཅད་ནི་འབབ་པར་བྱེད།
en: causing all rivers to flow;

source: མཚོ་དང་མཚེའུ་དང་ལུ་མ་ཐམས་ཅད་ནི་རྒྱས་པར་བྱེད།
en: causing lakes, ponds, and reservoirs to rise;

source: སྤོས་ཆུའི་ཆར་པ་ནི་རབ་ཏུ་འབབ་པར་བྱེད།
en: causing a great rain of scented water to fall;

source: མེ་ཏོག་གི་སྤྲིན་རབ་ཏུ་འཐོར་བའི་རླུང་ཆེན་པོ་ནི་ལྡང་བར་བྱེད།
en: causing a great wind that scattered a cloud of flowers to blow;

source: སིལ་སྙན་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་ནི་རབ་ཏུ་སྒྲ་སྒྲོག་པར་བྱེད།
en: causing a quintillion musical instruments to sound;

source: ལྷ་རྫས་ཀྱི་གཞལ་མེད་ཁང་དང་རྒྱན་གྱི་ཚོགས་མང་པོ་ནི་རབ་ཏུ་འཁྲོལ་བར་བྱེད།
en: causing a multitude of divine aerial palaces and ornaments to spread;

source: བ་ལང་དང་། ཁྱུ་མཆོག་དང་། གླང་པོ་དང་། སྟག་དང་། རི་དགས་ཀྱི་དབང་པོ་ནི་རབ་ཏུ་སྒྲ་འབྱིན་པར་བྱེད།
en: causing the lords of cows, bulls, elephants, tigers, and deer to make their cries;

source: ལྷ་དང་ལྷ་མ་ཡིན་དང་། ཀླུ་དང་འབྱུང་པོའི་དབང་པོ་རྣམས་ནི་འབྲུག་སྒྲ་འབྱིན་པར་བྱེད།
en: causing the leaders of devas, asuras, nāgas, and bhūtas to roar;

source: རིའི་དབང་པོ་ཆེན་པོ་རྣམས་ནི་ཕན་ཚུན་ཐུག་པར་བྱེད།
en: causing the great lords of mountains to clash together;

source: གཏེར་གྱི་ཚོགས་བྱེ་བ་བརྒྱ་སྟོང་ནི་མངོན་དུ་བྱུང་བར་བྱེད་ཅིང་སའི་འོག་ནས་འཐོན་ཏོ།
en: and causing trillions of masses of treasures to emerge.

source: །དེ་ནས་སའི་ལྷ་མོ་བརྟན་མས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་ཁྱོད་འདིར་འོངས་པ་ལེགས་སོ། །སའི་ཕྱོགས་འདི་ནི་སྔོན་ཁྱོད་ཀྱི་གནས་སུ་གྱུར་ཏེ། ཁོ་མོའི་མངོན་སུམ་དུ་དགེ་བའི་རྩ་བ་བསྐྱེད་པ་ཡིན་ན།
en: Then the earth goddess Sthāvarā said to Sudhana, the head merchant’s son, “Noble one, it is excellent that you have come here. This area is where in the past you dwelled and generated roots of merit, where I am the witness for that.

source: དེའི་རྣམ་པར་སྨྱིན་པའི་ཕྱོགས་འགའ་ཙམ་བལྟ་བར་འདོད་དམ།
en: Do you wish to see just a fraction of their ripening?”

source: དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Sudhana, the head merchant’s son, bowed his head to the feet of the earth goddess Sthāvarā.

source: སའི་ལྷ་མོ་བརྟན་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས།
en: He circumambulated the earth goddess Sthāvarā many hundreds of thousands of times, keeping her to his right.

source: སའི་ལྷ་མོ་བརྟན་མའི་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །འཕགས་མ་འཚལ་ལོ།
en: Then he stood before her and, with his hands placed together in homage, said, “Āryā, I do wish it!”

source: །དེ་ནས་སའི་ལྷ་མོ་བརྟན་མས་རྐང་པའི་མཐིལ་གྱིས་ས་ཆེན་པོ་ལ་བརྡབས་ཏེ། རིན་པོ་ཆེའི་གཏེར་བྱེ་བ་བརྒྱ་སྟོང་གྲངས་མེད་པ་རབ་ཏུ་བརྒྱན་པ་བསྟན་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་རིན་པོ་ཆེའི་གཏེར་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་འདི་དག་ཀྱང་ཁྱོད་ཀྱི་རྗེས་སུ་འབྲང་བའོ།
en: Then the earth goddess Sthāvarā stamped on the ground with the sole of her foot and revealed an array of countless millions of millions of precious treasures and said, “Noble one, these millions of millions of precious treasures follow you.

source: །ཁྱོད་ཀྱི་སྔོན་དུ་འགྲོ་བའོ།
en: They go before you.

source: །ཁྱོད་ཀྱིས་ཅི་དགར་སྤྱད་པའོ།
en: You can use them as you like.

source: །ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱི་རྣམ་པར་སྨིན་པ་ལས་བྱུང་བའོ།
en: They come from the ripening of your merit.

source: །ཁྱོད་ཀྱི་བསོད་ནམས་ཀྱི་སྟོབས་ཀྱིས་བསྲུངས་པའོ། །འདི་ལས་ལོང་སྟེ།
en: They are protected by the power of your merit.

source: ཁྱོད་ཀྱིས་ཅི་དགོས་པ་དེ་དག་གྱིས་ཤིག །རིགས་ཀྱི་བུ་གཞན་ཡང་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་ཐོབ་པ་སྟེ།
en: You can take from among them whatever you need. “Noble one, moreover, I have attained the bodhisattva liberation called the essence of invincible wisdom

source: དེ་ལྟར་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་འདི་དང་ལྡན་པས། དེ་བཞིན་གཤེགས་པ་མར་མེ་མཛད་ཚུན་ཆད་དུ་བྱང་ཆུབ་སེམས་དཔའི་རྗེས་སུ་འབྲང་ཞིང་། རྟག་ཏུ་བསྲུང་བ་ལ་ཞུགས་པ་སྟེ། དེ་ཚུན་ཆད་དུ་རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་སེམས་ཀྱི་སྤྱོད་པ་ལ་རྣམ་པར་སྤྱོད་དོ།
en: Through my possessing this bodhisattva liberation, since the time of the Tathāgata Dīpaṅkara I have constantly followed bodhisattvas and always protected them.

source: །ཡེ་ཤེས་ཀྱི་ཡུལ་ལ་འཇུག་གོ །སྨོན་ལམ་གྱི་དཀྱིལ་འཁོར་ཁོང་དུ་ཆུད་པར་བྱེད་དོ། །བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་རྣམ་པར་དག་པ་རྗེས་སུ་རྟོགས་པར་བྱེད་དོ། །ཏིང་ངེ་འཛིན་ཐམས་ཅད་ཀྱི་ཚུལ་གྱི་རྗེས་སུ་འབྲང་ངོ་། །བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་ཐམས་ཅད་དང་། སེམས་རྒྱ་ཆེན་པོས་རྒྱས་པར་འགེངས་སོ། །བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ཀྱི་སྟོབས་ཀྱིས་དབང་བསྒྱུར་བ་དང་། ཞིང་གི་དྲ་བ་ཐམས་ཅད་རྒྱས་པར་དགང་བ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱིས་ལུང་བསྟན་པ་ཡང་དག་པར་མནོད་པ་དང་། དུས་ཐམས་ཅད་དུ་མངོན་པར་འཚང་རྒྱ་བ་ཡང་དག་པར་བསྟན་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཚུལ་ཐམས་ཅད་དང་། མདོ་སྡེ་ཡང་དག་པར་བརྗོད་པའི་ཆོས་ཀྱི་སྤྲིན་གྱི་ཚུལ་ཐམས་ཅད་དང་། ཆོས་སྣང་བ་ཆེན་པོས་སྣང་བར་བྱ་བའི་ཚུལ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨྱིན་པར་བྱ་བའི་ཚུལ་དང་། སངས་རྒྱས་ཀྱི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡང་དག་པར་བསྟན་པའི་ཚུལ་ཡང་རྗེས་སུ་རྟོགས་པར་བྱེད་དོ།
en: Since that time, noble one, I have practiced the mental conduct of the bodhisattvas, been immersed within the scope of wisdom, entered the domain of prayer, realized pure bodhisattva conduct, followed the ways of all samādhis, permeated the vast motivations and higher cognitions of all bodhisattvas, and realized, possessed, and acquired mastery of the powers of all bodhisattvas, the pervasion of the network of all realms, the acquisition of prophecies from all the tathāgatas, the sight at all times of the attainment of buddhahood, all the ways of turning the wheel of the Dharma, all the ways of the clouds of Dharma that elucidate the sūtras, the way of illumination by the great radiance of the Dharma, the way of completely ripening all beings, and the way of the display of all the miraculous manifestations of the buddhas.

source: །ཡང་དག་པར་འཛིན་ཏོ། །ཡང་དག་པར་ནོད་དོ། །རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་འདི་ཡང་བསྐལ་པ་རི་རབ་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཕ་རོལ་དེའི་ཡང་ཕ་རོལ་ཅིག་ཏུ་འཇིག་རྟེན་གྱི་ཁམས་ཟླ་བའི་རྒྱལ་མཚན་ཞེས་བྱ་བར་བསྐལ་པ་སྣང་བས་རྣམ་པར་བརྒྱན་པ་ལ་དེ་བཞིན་གཤེགས་པ་སྤྱན་བཟང་པོ་ལས་ཐོབ་སྟེ།
en: “Noble one, I received this bodhisattva liberation, the essence of invincible wisdom , far beyond and even more beyond as many past kalpas as there are atoms in Sumeru , during a kalpa called Avabhāsa­vyūha, in a world realm called Candra­dhvajā, from the Tathāgata Sunetra

source: རིགས་ཀྱི་བུ་དེ་ལྟར་ཁོ་མོ་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་འདི་ལ་ཡོངས་སུ་དཔྱོད་དཔྱོད། རྣམ་པར་དཔྱོད་དཔྱོད། ཤིན་དུ་དཔྱོད་དཔྱོད། ཡང་དག་པར་འཕེལ་བར་བྱེད་བྱེད་དེ། ཤིན་ཏུ་རྒྱས་པར་བྱེད་བྱེད་པས། བསྐལ་པ་བཟང་པོ་ལ་ཐུག་གི་བར་དུ་དེ་བཞིན་གཤེགས་པ་མཐོང་བ་དང་མ་བྲལ་ལོ།
en: “Noble one, in that way, until this Bhadra kalpa, while cultivating, practicing, increasing, and augmenting this bodhisattva liberation called the essence of invincible wisdom , I have never been deprived of the sight of the tathāgatas.

source: །དེ་སྲིད་ཀྱི་བར་གྱིས་ཁོ་མོས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་སངས་རྒྱས་ཀྱི་ཞིང་བརྗོད་དུ་མེད་པའི་ཡང་བརྗོད་དུ་མེད་པའི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཅིག་བསྙེན་བཀུར་ཏོ།
en: “During that time, I have propitiated as many tathāgata arhat samyak­saṃbuddhas as there are atoms in an anabhilāpyānabhilāpya of buddha realms.

source: །དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་སྙིང་པོ་བྱང་ཆུབ་ཏུ་གཤེགས་པའི་རྣམ་པར་འཕྲུལ་པ་ཡང་མཐོང་སྟེ།
en: I have seen the miraculous manifestation of all those tathāgatas going to the bodhimaṇḍa.

source: ཁོ་མོ་ནི་དེ་བཞིན་གཤེགས་པ་དེ་དག་ཐམས་ཅད་ཀྱི་དགེ་བའི་རྩ་བ་མངོན་སུམ་དུ་མཐོང་བའོ།
en: I have witnessed the roots of merit of all those tathāgatas.

source: །རིགས་ཀྱི་བུ་ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་འདི་ཤེས་པར་ཟད་ན། ཁོ་མོས་བྱང་ཆུབ་སེམས་དཔའ་དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཀྱི་ཞམ་རིང་དུ་འབྲང་བ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་གསུང་གི་རྗེས་སུ་འབྲང་བ། དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་འཇུག་པར་དཀའ་བ་ལ་རབ་ཏུ་ཞུགས་པ། སེམས་ཀྱི་སྐད་ཅིག་གིས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྒྱས་པར་འགེངས་པའི་ཤུགས་དང་ལྡན་པ།
en: “Noble one, I know only the bodhisattva liberation called the essence of invincible wisdom

source: དེ་བཞིན་གཤེགས་པ་དང་མཉམ་པ་ཉིད་དུ་གྱུར་པའི་ལུས་དང་ལྡན་པ། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་དགོངས་པ་དྲི་མ་མེད་པའི་སྙིང་པོར་གྱུར་པ། སངས་རྒྱས་འབྱུང་བ་ཐམས་ཅད་རྟག་ཏུ་མངོན་པར་བསྒྲུབས་པ། སངས་རྒྱས་ཀྱི་འཕྲིན་ལས་ཐ་མི་དད་པའི་ཕོ་ཉར་གྱུར་པ། དེ་དག་གི་སྤྱོད་པ་ཤེས་པའམ།
en: How could I know the conduct or describe the qualities of bodhisattvas who attend all tathāgatas, who follow the teaching of all buddhas, who enter into the impenetrable wisdom of the tathāgatas, who have the power to pervade the entire realm of phenomena in one instant of mind, who have bodies that are the same as those of the tathāgatas, who have the essence of the stainless intention of all the buddhas, who always realize all appearances of buddhas, and who are emissaries inseparable from the activity of the buddhas? “Depart, noble one.

source: ཡོན་ཏན་བརྗོད་པར་ནུས་རེ་སྐན། །སོང་རིགས་ཀྱི་བུ་འཛམ་བུའི་གླིང་འདི་ཉིད་ཀྱི་ཡུལ་མ་ག་དྷ་ཞེས་བྱ་བ་ན་གྲོང་ཁྱེར་སེར་སྐྱའི་གནས་ཞེས་བྱ་བ་ཡོད་དེ། དེ་ན་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ཞེས་བྱ་བ་འདུག་གིས་དེའི་གན་དུ་སོང་ལ།
en: In this Jambudvīpa, in the land of Magadha, in the city of Kapilavastu, is the goddess of the night named Vāsantī.

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔས་བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ལ་བསླབ་པར་བྱ་བ་དང་། ཇི་ལྟར་ནན་ཏན་དུ་བྱ་བ་དྲིས་ཤིག །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ཀྱིས་སའི་ལྷ་མོ་བརྟན་མའི་རྐང་པ་གཉིས་ལ་སྤྱི་བོས་ཕྱག་འཚལ་ཏེ།
en: Go to her and ask her, ‘How should a bodhisattva train in bodhisattva conduct? How should a bodhisattva practice it?’

source: སའི་ལྷ་མོ་བརྟན་མ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་ཡང་དང་ཡང་བལྟས་ཏེ།
en: Then Sudhana, the head merchant’s son, bowed his head to the feet of the earth goddess Sthāvarā, circumambulated the earth goddess Sthāvarā many hundreds of thousands of times, keeping her to his right, and, looking back again and again, departed from the earth goddess Sthāvarā. Vāsantī

source: སའི་ལྷ་མོ་བརྟན་མའི་དྲུང་ནས་སོང་ངོ་། །དེ་ནས་ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་སའི་ལྷ་མོ་བརྟན་མའི་གདམས་ངག་རྗེས་སུ་དྲན་པར་བྱེད་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་ཡེ་ཤེས་ཐུབ་པར་དཀའ་བའི་སྙིང་པོ་ཅན་དེ་རྗེས་སུ་དྲན་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་བསྒོམ་པ་དེ་རབ་ཏུ་གོམས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཆོས་ཀྱི་ཚུལ་དེའི་རྗེས་སུ་བསམ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས་རྣམ་པར་རྩེ་བ་དེ་ལ་རྣམ་པར་དཔྱད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ཤིན་ཏུ་ཕྲ་བ་དེ་ལ་རྣམ་པར་བལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་དེ་ལ་འཇུག་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ཐ་དད་པ་དེ་ལ་ཡིད་ཆེས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་ཤིན་ཏུ་སྦྱང་བ་དེ་རྗེས་སུ་རྟོགས་པར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པའི་ཡེ་ཤེས་རྒྱ་མཚོ་དེ་ལ་འབབ་པར་བྱ་བ་བྱེད་ཅིང་། གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་གང་ན་བ་དེར་ཕྱིན་ཏེ།
en: Sudhana, the head merchant’s son, remembering the teaching of the earth goddess Sthāvarā, remembering the bodhisattva liberation called the essence of invincible wisdom , becoming adept in the meditation of bodhisattva samādhi, contemplating the way of the bodhisattva Dharma, analyzing the displays of bodhisattva liberation, viewing the very subtle wisdom of bodhisattva liberation, entering the ocean of the wisdom of bodhisattva liberation, with faith in the different wisdoms of bodhisattva liberation, realizing the mastery of the wisdom of bodhisattva liberation, and descending into the ocean of the wisdom of bodhisattva liberation, arrived at the location of the town of Kapilavastu.

source: གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ལ་གཡས་ཕྱོགས་སུ་བསྐོར་ནས། ཤར་ཕྱོགས་ལོགས་ཀྱི་གྲོང་ཁྱེར་གྱི་སྒོ་ནས་སོང་སྟེ།
en: He circumambulated the town of Kapilavastu, keeping it to his right, and entered the town through its eastern gate.

source: ཉི་མ་ནུབ་ནས་རིང་པོ་མ་ལོན་པ་ཞིག་ཏུ་གྲོང་ཁྱེར་གྱི་ལམ་གྱི་སུམ་མདོའི་དབུས་ཤིག་ན། བྱང་ཆུབ་སེམས་དཔའི་གདམས་ངག་མཐུན་པར་ལེན་པ་དེ་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་མཐོང་བར་འདོད་ཅིང་། དགེ་བའི་བཤེས་གཉེན་ཡོད་ན་སངས་རྒྱས་ཀྱི་ཡེ་ཤེས་ཐོབ་པར་འགྱུར་བར་ངེས་པའི་བློ་གྲོས་དང་ལྡན་པ། ཡེ་ཤེས་ཀྱི་མིག་ཀུན་ཏུ་ལྟ་བའི་ཡུལ་གྱི་རང་བཞིན་གྱི་བྱིན་གྱི་རླབས་དང་ལྡན་པ། ཕྱོགས་ཐམས་ཅད་དུ་མངོན་པར་གཞོལ་ཞིང་། དགེ་བའི་བཤེས་གཉེན་ལ་བལྟ་བའི་སེམས་ཀྱིས་མོས་པ་དང་། ཡེ་ཤེས་ཆེན་པོའི་སྙིང་པོར་གྱུར་པའི་འདུ་ཤེས་ཀྱི་སེམས་དང་ལྡན་པ། དམིགས་པ་ཐམས་ཅད་ལ་རབ་ཏུ་ཞུགས་པའི་ཡེ་ཤེས་ཀྱི་མིག་དང་ལྡན་པ། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐམས་ཅད་དུ་ཡེ་ཤེས་རྒྱ་མཚོ་འབྱམ་ཀླས་པས་རྒྱས་པར་འགེངས་པ་དང་ལྡན་པའི་ཏིང་ངེ་འཛིན་གྱི་མིག་གིས་ཕྱོགས་ཐམས་ཅད་དུ་ཤེས་བྱའི་རྒྱ་མཚོ་ལ་རྣམ་པར་ལྟ་བ།
en: He stayed at the town’s central junction of three streets, where, soon after sunset, wishing to see Vāsantī, the goddess of the night, while reverentially following the bodhisattva teaching, having the definite understanding that the wisdom of buddhahood is attained through kalyāṇamitras, having the blessing of the scope of the view of the eyes of wisdom, facing every direction with the aspiration to see the kalyāṇamitra, with a mind that perceives the essence of great wisdom, with eyes of wisdom that engage with all objects of perception, with eyes of samādhi that pervade the vast extent of the ocean of the wisdom of all the ways of the realm of phenomena, seeing the ocean of all that is to be known in all directions, with a single-pointed mind intent on attaining the eyes of wisdom resting with one-pointed thought, he saw Vāsantī, the goddess of the night, in the realm of space above the great town of Kapilavastu.

source: ཡེ་ཤེས་ཆེན་པོའི་མིག་འཐོབ་པར་བྱ་བ་ལ་རབ་ཏུ་གཞོལ་ཞིང་བསམ་པ་རྩེ་གཅིག་ཏུ་བཞག་ནས་འདུག་པ་དང་། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་དེ་གྲོང་ཁྱེར་ཆེན་པོ་སེར་སྐྱའི་གནས་ཀྱི་སྟེང་གི་ནམ་མཁའི་དབྱིངས་ལས་ནོར་བུ་རིན་པོ་ཆེ་སྣ་ཚོགས་དཔེ་མེད་པའི་ཁང་པ་བརྩེགས་པ་ཞིག་ན།
en: She was in a kūṭāgāra of various precious jewels beyond compare.

source: རིན་པོ་ཆེའི་སེང་གེའི་ཁྲི་ཆེན་པོ་སྤོས་ཞིམ་པོ་ཐམས་ཅད་ཀྱི་པདྨོའི་སྙིང་པོ་ཅན་ཞིག་ལ་ལུས་ཀྱི་མདོག་གསེར་གྱི་ཁ་དོག་ཏུ་འདུག་པ།
en: She was seated upon a lotus that had every excellent aroma, in the center of a great precious lion throne. Her body was the color of gold.

source: སྐྲ་འཇམ་ཞིང་མང་ལ་མཐོན་ཏིང་དུ་འདུག་པ།
en: Her hair was soft, abundant, and deep black.

source: མིག་དཀར་ནག་འབྱེས་པ། གཟུགས་བཟང་ཞིང་མཛེས་པ། བལྟ་ན་སྡུག་པ།
en: Her eyes were deep black. She was beautiful, attractive, and lovely to the sight.

source: ལུས་རྒྱན་དང་ལྷབ་ལྷུབ་ཐམས་ཅད་ཀྱིས་ཀླུབས་ཤིང་བརྒྱན་པ།
en: Her body was beautified by all jewelry and adornments.

source: ཁ་དོག་བསྒྱུར་བའི་གོས་བགོས་པ་ཚངས་པའི་གཙུག་ཏོར་གྱི་ཅོད་པན་ཟླ་བའི་དཀྱིལ་འཁོར་གྱིས་བརྒྱན་པ་ཐོགས་པ་ལུས་ལ་རྒྱུ་སྐར་དང་། གཟའ་དང་སྐར་ཆེན་དང་། སྐར་མའི་ཚོགས་ཐམས་ཅད་ཀྱི་གཟུགས་བརྙན་སྣང་བར་གྱུར་བ་འདུག་པ་མཐོང་ངོ་།
en: She was wearing dyed clothing. She possessed a sacred topknot adorned by the disk of the moon as a crest. The constellations, the planets, and all the stars appeared in her body.

source: །དེས་སེམས་ཅན་གྱི་ཁམས་ཡངས་པར་མི་ཁོམ་པ་དང་། ངན་སོང་དང་། ངན་འགྲོ་དང་། ལོག་པར་ལྟུང་བ་ནས་སེམས་ཅན་ཇི་སྙེད་ཅིག་ཡོངས་སུ་བགྲོལ་བ་དེ་དག་ཐམས་ཅད་ཀྱང་དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་།
en: He saw within her pores all the beings she had liberated who in the vast realm of beings had fallen into inopportune states, lower existences, and lower realms.

source: །ཇི་སྙེད་ཅིག་མཐོ་རིས་ཀྱི་འཇིག་རྟེན་དུ་བཀོད་པ་དང་། ཇི་སྙེད་ཅིག་ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱི་བྱང་ཆུབ་དང་། ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ། དེ་དག་ཐམས་ཅད་ཀྱང་དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་།
en: He saw within her pores all those she had brought to the higher realms, all those she had ripened for the enlightenment of the śrāvakas and pratyeka­buddhas, and those she had ripened for omniscience.

source: །ལུས་མངོན་པར་བསྒྲུབ་པ་དང་། གཟུགས་མངོན་པར་བསྒྲུབ་པ་དང་། ཁ་དོག་མངོན་པར་བསྒྲུབ་པའི་ཐབས་སྣ་ཚོགས་ཀྱིས་ཇི་སྙེད་ཅིག་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་།
en: He saw within her pores all her created bodies, created forms, and created colors that were her various methods that ripened beings.

source: །ང་རོ་མངོན་པར་བསྒྲུབ་པ་དང་། དབྱངས་ཀྱི་ཡན་ལག་མངོན་པར་བསྒྲུབ་པ་དང་། སྐད་ཀྱི་ཚུལ་སྣ་ཚོགས་ཡོངས་སུ་སྦྱར་བ་ཇི་སྙེད་ཅིག་གིས་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་། དེའི་བ་སྤུའི་སྒོ་ནས་རྗེས་སུ་བརྗོད་པ་ཐོས་སོ།
en: He heard sounding from her pores the creation of sounds, the creation of the aspects of the voice, and their application to the various ways of speech through which she ripened beings.

source: །དུས་མངོན་པར་བསྒྲུབ་པ་དང་། བསམ་པ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཀྱི་རྗེས་སུ་འབྲང་བར་བྱ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་གནོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་གྱི་རྣམ་པར་འཕྲུལ་པའི་སྒོ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་སྤྱོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཡོངས་སུ་ལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ལྟ་བ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་འཕྲུལ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྐྱེས་བུ་སེང་གེ་ཆེན་པོའི་རྣམ་པར་བསྒྱིངས་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པས།
en: He perceived within her pores her creation of times, her bodhisattva conduct, her bodhisattva prowess, her entrances to bodhisattva samādhis and transformations, her bodhisattva power of leadership, her bodhisattva states of being, her bodhisattva view, her bodhisattva observation, her bodhisattva emanations, her bodhisattva lion-like awesomeness of a great being, and her displays of bodhisattva liberation through which she ripened beings in accordance with their motivations and aspirations.

source: རྣམ་པར་རྩེ་བ་ཇི་སྙེད་ཅིག་གིས་དེས་སེམས་ཅན་ཡོངས་སུ་སྨྱིན་པར་བྱས་པ་དེ་དག་ཀྱང་། དེའི་བ་སྤུའི་སྦུབས་སུ་ཆུད་པར་མཐོང་ངོ་། །དེས་ཐབས་སྣ་ཚོགས་དང་ལྡན་པའི་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་དེ་དག་མཐོང་ཞིང་ཐོས་ནས་དགའ་རངས་ཏེ་མགུ་ཞིང་ཉམས་བདེ་ལ་ཚིམ་ཞིང་ཡིད་བདེ་བ་སྐྱེས་ནས།
en: He saw and heard an ocean of the ways of the Dharma that employed various methods, and he was satisfied, joyful, pleased, delighted, content, and happy.

source: མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་དེ་ལ་ལུས་ཐམས་ཅད་ཀྱིས་ཕབ་ནས་ཕྱག་འཚལ་ཏེ། ལངས་ནས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པ་ལ་ལན་བརྒྱ་སྟོང་དུ་མར་གཡས་ཕྱོགས་སུ་བསྐོར་བ་བྱས་ནས་མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པའི་མདུན་དུ་འདུག་སྟེ་ཐལ་མོ་སྦྱར་ནས་འདི་སྐད་ཅེས་སྨྲས་སོ།
en: He prostrated to the night goddess Vāsantī with the full length of his body, got up, and circumambulated the night goddess Vāsantī, keeping her to his right, many hundreds of thousands of times.

source: །ལྷ་མོ་བདག་གིས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་སེམས་བསྐྱེད་དེ་དེ་ལྟར་བདག་གིས་དགེ་བའི་བཤེས་གཉེན་གྱི་བྱིན་གྱི་རླབས་ཀྱིས་སངས་རྒྱས་ཀྱི་ཡོན་ཏན་ཐམས་ཅད་འབྱུང་བར་ཡང་དག་པར་མཐོང་པས།
en: Then he stood before her and, with his hands placed together in homage, said, “Goddess, I have developed the aspiration for the highest, complete enlightenment. I have seen that all the qualities of buddhahood arise through the blessing of a kalyāṇamitra.

source: དགེ་བའི་བཤེས་གཉེན་གྱི་ཕྱག་ཏུ་བདག་ཉིད་བོར་བ་ལགས་ན།
en: I put myself in the hands of the kalyāṇamitra.

source: ལྷ་མོ་ཤུལ་གང་ལ་བརྟེན་ན། བྱང་ཆུབ་སེམས་དཔའི་སྟོབས་བཅུའི་སར་འབྱུང་བར་འགྱུར་བའི་ཐམས་ཅད་མཁྱེན་པའི་ཤུལ་བདག་ལ་བཤད་དུ་གསོལ།
en: Show me, goddess, the path to omniscience upon which a bodhisattva will bring forth the ten strengths.”

source: དེ་སྐད་ཅེས་སྨྲས་པ་དང་། མཚན་མོའི་ལྷ་མོ་དཔྱིད་དང་ལྡན་པས། ཚོང་དཔོན་གྱི་བུ་ནོར་བཟངས་ལ་འདི་སྐད་ཅེས་སྨྲས་སོ། །རིགས་ཀྱི་བུ་དེ་ལྟར་ཁྱོད་དགེ་བའི་བཤེས་གཉེན་ཀྱི་སྦྱིན་གྱིས་ནོན་ཏེ། དགེ་བའི་བཤེས་གཉེན་ཀྱི་ཚིག་མཉན་པར་འདོད་པ་དང་། དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་དག་ལ་ནན་ཏན་དུ་བྱེད་པའི་ལེགས་སོ་ལེགས་སོ།
en: The night goddess Vāsantī said to Sudhana, the head merchant’s son, “Noble one, it is excellent, excellent, that you are thus in awe of kalyāṇamitras and wish to hear a kalyāṇamitra’s words and practice the teaching of kalyāṇamitras.

source: །རིགས་ཀྱི་བུ་ཁྱོད་དེ་ལྟར་དགེ་བའི་བཤེས་གཉེན་གྱི་གདམས་ངག་ལ་ནན་ཏན་དུ་བྱེད་པས། གདོན་མི་ཟ་བར་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ཏུ་ཉེ་བར་འགྱུར་རོ།
en: “Noble one, through thus practicing the teaching of the kalyāṇamitras, you will, without a doubt, approach the highest, complete enlightenment.

source: །རིགས་ཀྱི་བུ་ཁོ་མོ་ནི་བྱང་ཆུབ་སེམས་དཔའི་རྣམ་པར་ཐར་པ་སེམས་ཅན་ཐམས་ཅད་ཀྱི་མུན་པ་རྣམ་པར་སེལ་བའི་ཆོས་ཀྱི་སྣང་བས་འགྲོ་བ་རྣམ་པར་འདུལ་བའི་སྒོ་ཐོབ་པ་སྟེ།
en: “Noble one, I have attained the bodhisattva liberation called the gateway to guiding beings through the radiance of the Dharma that eliminates the darkness of all beings

source: བསམ་པ་མི་མཉམ་པ་དང་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་བྱམས་པའི་སེམས་དང་ལྡན་པའོ།
en: My mind has love for beings who have unstable minds.

source: །མི་དགེ་བའི་ལས་ཀྱི་ལམ་ལ་ཞུགས་པ་རྣམས་ལ་སྙིང་རྗེའི་སེམས་དང་ལྡན་པའོ།
en: My mind has compassion for beings who follow the path of nonvirtuous actions.

source: །དགེ་བའི་ལས་ཀྱི་ལམ་ལ་ཞུགས་པ་རྣམས་ལ་དགའ་བའི་སེམས་དང་ལྡན་པའོ།
en: My mind rejoices in those who follow the path of virtuous actions.

source: །སེམས་མཉམ་པར་དང་མི་མཉམ་པར་ལྡན་པའི་སེམས་ཅན་རྣམས་ལ་མི་གཉིས་པའི་སེམས་དང་ལྡན་པའོ།
en: My mind does not discriminate between beings with stable and unstable minds.

source: །ཀུན་ནས་ཉོན་མོངས་བ་རྣམས་ལ་རྣམ་པར་བྱང་བའི་སེམས་དང་ལྡན་པའོ།
en: My motivation is to purify those afflicted by the kleśas.

source: །ཉམ་ང་བར་གྱུར་པ་རྣམས་ལ་ཡང་དག་པར་ཞུགས་པའི་སེམས་དང་ལྡན་པའོ།
en: My motivation is to bring the pitiful to perfection.

source: །དམའ་བ་ལ་མོས་པ་རྣམས་ལ་ཡངས་པ་ལ་མོས་པ་ཡོངས་སུ་བསྐྱེད་པའི་སེམས་དང་ལྡན་པའོ།
en: My motivation is to generate a vast aspiration in those with inferior aspiration.
